[
    {
        "name": "Omelette",
        "ingredients": [
            "3 Whole Eggs",
            "1 Tbsp Butter",
            "1/2 Tomato",
            "1/3 cup Cheese"

        ],
        "instructions": [
            "Crack the eggs into a bowl",
            "Whisk the eggs",
            "Put the butter in a pan",
            "Pour the eggs into the pan",
            "Fold the eggs in half"
        ]
    },
    {
        "name": "Banana Smoothie",
        "ingredients": [
            "1 Whole Banana",
            "2 Cups Milk",
            "1 Tbsp Honey"
        ],
        "instructions": [
            "Peel the banana and slice it into chunks",
            "Place the banana chunks into a blender",
            "Pour the milk into the blender",
            "Add honey to the blender if desired for sweetness",
            "Blend the ingredients until smooth and creamy",
            "Taste the smoothie and adjust the sweetness or consistency if needed by adding more honey or milk",
            "Once satisfied with the taste and texture, pour the smoothie into glasses",
            "Optionally, garnish with a slice of banana or a sprinkle of cinnamon",
          "Serve immediately and enjoy your delicious banana smoothie!"
        ]
    },
    {
        "name": "Caesar Salad",
        "ingredients": [
            "1 Head Lettuce",
            "10 Grams Crouton",
            "2 Grams Cheese",
            "2 Tbsp SaladDressing"],
          "instructions":[
            "In a large salad bowl, combine the chopped romaine lettuce and croutons.",

            "In a small bowl, whisk together the mayonnaise, grated Parmesan cheese, lemon juice, Dijon mustard, minced garlic, salt, and pepper until well combined.",

            "Slowly drizzle in the olive oil while whisking continuously until the dressing is smooth and creamy.",

            "Pour the dressing over the romaine lettuce and croutons in the salad bowl.",

            "Toss the salad gently until the lettuce and croutons are evenly coated with the dressing.",

            "Sprinkle the grated Parmesan cheese over the top of the salad as a garnish.",

            "Serve the Caesar salad immediately as a side dish or topped with grilled chicken or shrimp for a complete meal."
          ]
    },
    {
        "name": "Spaghetti and Meatballs",
        "ingredients": [
            "1 Serving Noodle",
            "30 Grams Sauce", 
            "5 Whole Meatball"
        ]
    },
    {
        "name": "Pepperoni Pizza",
        "ingredients": [
            "2 Cup Flour", 
            "1 Cup Water", 
            "70 Grams Sauce", 
            "40 Grams Cheese", 
            "30 Grams Pepperoni"
        ]
    },
    {
      "name": "Creme Brulee",
      "ingredients":[
        "2 cups Cream",
        "1/2 cup Sugar",
        "4 Whole Eggs",
        "1 tsp VanillaExtract"
      ],
      "instructions": [
      "Preheat your oven to 325°F (160°C). Place six ramekins in a baking dish large enough to hold them without touching.",
      "In a saucepan, heat the heavy cream over medium heat until it just begins to simmer. Remove from heat and let it cool for a few minutes.",
      "In a separate bowl, whisk together the egg yolks and sugar until well combined and slightly thickened.",
      "Slowly pour the warm cream into the egg mixture, whisking constantly to avoid scrambling the eggs. Stir in the vanilla extract.",
      "Strain the mixture through a fine-mesh sieve to remove any lumps or air bubbles. Then, evenly divide the mixture among the ramekins.",
      "Carefully pour hot water into the baking dish until it reaches halfway up the sides of the ramekins, creating a water bath for even baking.",
      "Bake in the preheated oven for 30-35 minutes, or until the edges are set but the centers still jiggle slightly when gently shaken.",
      "Remove the ramekins from the water bath and let them cool to room temperature. Then, cover and refrigerate for at least 2 hours, or until thoroughly chilled.",
      "Just before serving, sprinkle a thin, even layer of granulated sugar over the top of each creme brulee. Use a kitchen torch to caramelize the sugar until it forms a golden-brown crust.",
      "Allow the caramelized sugar to cool and harden for a minute or two before serving. Enjoy your delicious homemade creme brulee!"
      ]
    },

    {
      "name": "Asian  Stirfry",
      "ingredients": [
        "1 lb Beef",
        "2 tsp Oil",
        "3 cups MixedVegetables",
        "3 cloves Garlic",
        "1 tbs Ginger",
        "1/4 cup SoySauce",
        "2 tbs OysterSauce",
        "1 tbs SesameOil"
      ],
      "instructions":[
        "Prepare all your ingredients by slicing or chopping the protein and vegetables.",
        "Heat the vegetable oil in a large skillet or wok over medium-high heat.",
        "Add the protein to the skillet and cook until browned and cooked through. If using tofu, you can brown it on all sides. If using shrimp, it should turn pink and opaque. Remove the protein from the skillet and set aside.",
        "In the same skillet, add a little more oil if needed. Add the minced garlic and ginger (if using) and cook for about 30 seconds, or until fragrant.",
        "Add the mixed vegetables to the skillet and stir-fry for 3-5 minutes, or until they are tender-crisp. You can adjust the cooking time depending on your preference for how crunchy or soft you like your vegetables.",
        "Return the cooked protein to the skillet and stir to combine with the vegetables.",
        "In a small bowl, mix together the soy sauce, oyster sauce (if using), and sesame oil. Pour the sauce over the stir-fry in the skillet.",
        "Stir everything together until well coated in the sauce and heated through.",
        "Serve the stir-fry hot over cooked rice or noodles.",
        "Garnish with sliced green onions, sesame seeds, or chopped cilantro if desired."
      ]
      
    }

]